# My Initial Steps with Maji Ndogo Data
I'm diving into this database of 60,000 records, which has been collected carefuly. The first crucial phases for me involve getting familiar with the data.

# Key task to tackle in the first phase of the project
# 1. Getting to Know My Data: 
I'm starting by identifying all tables and reviewing their first few records to understand the database structure.

# 2. Diving into the Water Sources:
I'm finding the table with water source types and querying for unique types to understand which water sources are available.

# 3. Unpacking the Visits to Water Sources: 
Analyzing the visits table to understand patterns and frequencies of visits to different the different water sources.

# 4. Assessing the Quality of Water Sources: 
Checking the water_quality table for scores and visit counts to identify sources with decent quality and frequent use.

## 5. Investigating Pollution Issues: 
I'm looking into the well_pollution table to pinpoint any contaminated sources and understand the nature of the pollution.

In [ ]:
### Connecting to the database md_water_service_db

In [4]:
%load_ext sql

In [5]:
%sql mysql+pymysql://root:psenjen@localhost:3306/md_water_services

'Connected: root@md_water_services'

# 1 Getting to know the data by exploring the tables 
Showing all the tables we have in our database.

In [55]:
%%sql

show tables;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
8 rows affected.

[('data_dictionary',),
 ('employee',),
 ('global_water_access',),
 ('location',),
 ('visits',),
 ('water_quality',),
 ('water_source',),
 ('well_pollution',)]

## Exploring some of the tables to see the data inside.
#### (We also have a data_dictionary where we can explore all the tables and their columns in the database)

From the **location table**. I can see that this table details specific locations, including their addresses, provinces, towns, and whether they are urban or not.While the exact location isn't immediately clear, there is an identifying number for each location.

In [5]:
%%sql
select* 
from location
limit 5
;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('AkHa00000', '2 Addis Ababa Road', 'Akatsi', 'Harare', 'Urban'),
 ('AkHa00001', '10 Addis Ababa Road', 'Akatsi', 'Harare', 'Urban'),
 ('AkHa00002', '9 Addis Ababa Road', 'Akatsi', 'Harare', 'Urban'),
 ('AkHa00003', '139 Addis Ababa Road', 'Akatsi', 'Harare', 'Urban'),
 ('AkHa00004', '17 Addis Ababa Road', 'Akatsi', 'Harare', 'Urban')]

In [ ]:
%%sql
select* 
from location
limit 5
;

### Exploring the Visit table
This table suggests that an employee (assigned_employee_id) visited a specific location (location_id) at a recorded time (time_of_record) and identified a water source (source_id) there. It also contains the time they queued and the visit count.

In [7]:
%%sql 
select* 
from visits
limit 5
;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[(0, 'SoIl32582', 'SoIl32582224', datetime.datetime(2021, 1, 1, 9, 10), 1, 15, 12),
 (1, 'KiRu28935', 'KiRu28935224', datetime.datetime(2021, 1, 1, 9, 17), 1, 0, 46),
 (2, 'HaRu19752', 'HaRu19752224', datetime.datetime(2021, 1, 1, 9, 36), 1, 62, 40),
 (3, 'AkLu01628', 'AkLu01628224', datetime.datetime(2021, 1, 1, 9, 53), 1, 0, 1),
 (4, 'AkRu03357', 'AkRu03357224', datetime.datetime(2021, 1, 1, 10, 11), 1, 28, 14)]

# 2. Diving into the Water Sources:
Understanding the type of water sources we are dealing with indepth;
### 2.1 River: 
People directly collect drinking water from rivers. This is an open water source used by millions in Maji Ndogo. It carries a very high risk of biological and other contamination, making it the least safe water option.

### 2.2 Well: 
These sources access underground water and are often shared by communities. As they are closed systems, they have a lower risk of contamination compared to rivers. However, due to past issues with aging infrastructure and corruption, many wells are unfortunately not clean.

### 2.3 Shared Tap: 
This refers to a public tap in a communal area, serving multiple households.

### 2.4 Tap in Home: 
These are taps installed inside citizens' homes, typically serving a household of about six people.

### 2.5 Broken Tap in Home: 
These are also taps installed in homes, but the supporting infrastructure (like pipes or treatment plants) is non-functional due to damage or breakdown. This means no water is accessible from these points.

<t>if a record says a tap serves 956 people, it means that data from about 160 homes (assuming an average of 6 people per house) were rolled up into that one entry. It's a way to summarize the impact of water access across communities without overwhelming the database.</t>

In [15]:
%%sql

select distinct type_of_water_source -- getting the unique water sources available,
from water_source
limit 5
;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('tap_in_home',),
 ('tap_in_home_broken',),
 ('well',),
 ('shared_tap',),
 ('river',)]

# 3. Unpacking the Visits to Water Sources:
Imagine queueing 8 hours for water?
Finding which water sources has these long queues

In [37]:
%%sql 

select*
from visits
where time_in_queue >= 500
limit 3
;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
3 rows affected.

[(899, 'SoRu35083', 'SoRu35083224', datetime.datetime(2021, 1, 16, 10, 14), 6, 515, 28),
 (2304, 'SoKo33124', 'SoKo33124224', datetime.datetime(2021, 2, 6, 7, 53), 5, 512, 16),
 (2315, 'KiRu26095', 'KiRu26095224', datetime.datetime(2021, 2, 6, 14, 32), 3, 529, 8)]

## Finding which water sources has these long queues.
We see that the shared taps are the ones with the long queues.
We are using the source_ids from the water_source table to link to the visit table.

In [39]:
%%sql 
select ws.type_of_water_source,
        v.visit_count,
        ws.type_of_water_source,
        v.time_in_queue
from water_source ws
inner join visits v ON V.source_id = ws.source_id
order by v.time_in_queue desc
limit 5
;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('shared_tap', 2, 'shared_tap', 539),
 ('shared_tap', 2, 'shared_tap', 539),
 ('shared_tap', 3, 'shared_tap', 539),
 ('shared_tap', 6, 'shared_tap', 538),
 ('shared_tap', 5, 'shared_tap', 538)]

# 4. Assessing the Quality of Water Sources: 
## The main focus for this survey is to evaluate the quality of the water sources. I'm looking at a specific table that logs a quality score for each visit a field surveyor made to a water source. These scores range from 1 (terrible) to 10 (excellent, usually for clean home taps).
Shared taps are not rated as high, and the score also depends on how long the queue times are.

Confrming if this hypothesis is true. The surveyors only made multiple visits to shared taps and did not revisit other types of water sources. So
there should be no records of second visits to locations where there are good water sources, like taps in homes.

The hypothesis is true there are not records of second visit to the home taps and they have a good subjective scores.We can also observe there is almost no queue time unlike in shared taps.

In [69]:
%%sql

select wq.record_id,
       wq.subjective_quality_score,
        wq.visit_count,
       v.time_in_queue,
       ws.type_of_water_source
from water_quality as wq
JOIN visits as v ON v.record_id = wq.record_id
JOIN water_source as ws ON v.source_id = ws.source_id 
where 
wq.subjective_quality_score = 10
AND
ws.type_of_water_source in ('tap_in_home', 'tap_in_home_broken')
AND wq.visit_count >= 1
limit 5
;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[(13, 10, 1, 0, 'tap_in_home'),
 (14, 10, 1, 0, 'tap_in_home'),
 (9, 10, 1, 0, 'tap_in_home'),
 (24, 10, 1, 0, 'tap_in_home'),
 (16, 10, 1, 0, 'tap_in_home')]

# 5. Investigating Pollution Issues: 

The well pollution data shows the presence of either biological contaminants or excessive heavy metals and other pollutants. Based on these findings, the results field in the table labels each well as 'Clean', 'Contaminated: Biological', or 'Contaminated: Chemical'. This classification is crucial, as wells with biological or other contaminants are unsafe for drinking.

In [70]:
%%sql 

SELECT * FROM md_water_services.well_pollution
limit 5
;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('KiRu28935224', datetime.datetime(2021, 1, 4, 9, 17), 'Bacteria: Giardia Lamblia', 0.0, 495.898, 'Contaminated: Biological'),
 ('AkLu01628224', datetime.datetime(2021, 1, 4, 9, 53), 'Bacteria: E. coli', 0.0, 6.09608, 'Contaminated: Biological'),
 ('HaZa21742224', datetime.datetime(2021, 1, 4, 10, 37), 'Inorganic contaminants: Zinc, Zinc, Lead, Cadmium', 2.715, 0.0, 'Contaminated: Chemical'),
 ('HaRu19725224', datetime.datetime(2021, 1, 4, 11, 4), 'Clean', 0.0288593, 9.56996e-05, 'Clean'),
 ('SoRu35703224', datetime.datetime(2021, 1, 4, 11, 29), 'Bacteria: E. coli', 0.0, 22.5009, 'Contaminated: Biological')]

## **Checking the integrity of the data.** 
The worst case is if we have contamination, but we think we don't. People can get sick, so we
need to make sure there are no errors here.

In the well pollution table, the descriptions are notes taken by our scientists as text, so it will be challenging to process it. The
biological column is in units of CFU/mL, so it measures how much contamination is in the water. 0 is clean, and anything more than
0.01 is contaminated.We confrm this by writing a query that checks if the results is Clean but the biological column is > 0.01.

In [7]:
%%sql
select* 
from well_pollution
where results = 'clean' AND biological >0.01
limit 5
;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('AkRu08936224', datetime.datetime(2021, 1, 8, 9, 22), 'Bacteria: E. coli', 0.0406458, 35.0068, 'Clean'),
 ('AkRu06489224', datetime.datetime(2021, 1, 10, 9, 44), 'Clean Bacteria: Giardia Lamblia', 0.0897904, 38.467, 'Clean'),
 ('SoRu38011224', datetime.datetime(2021, 1, 14, 15, 35), 'Bacteria: E. coli', 0.0425095, 19.2897, 'Clean'),
 ('AkKi00955224', datetime.datetime(2021, 1, 22, 12, 47), 'Bacteria: E. coli', 0.0812092, 40.2273, 'Clean'),
 ('KiHa22929224', datetime.datetime(2021, 2, 6, 13, 54), 'Bacteria: E. coli', 0.0722537, 18.4482, 'Clean')]

Comparing the query results with the full table reveals inconsistencies in how well statuses are recorded. It appears some data entry staff mistakenly used the description field to determine water cleanliness. Specifically, records where the description starts with "Clean" were classified as 'Clean' in the results column, even when the biological contamination level was greater than 0.01.

The correct procedure is that "Clean" should only appear in the description if there's no biological or chemical contamination. This suggests data personnel inaccurately transcribed scientists' notes.The immediate task is to identify and remove the "Clean" prefix from descriptions associated with biological contamination to prevent future errors.

In [ ]:
### finding all instances where the biological column shows a value greater than 0.01, but the results column is still marked 'Clean'.
38 rows have been returned but showing only 5 for now

In [11]:
%%sql

select*
from well_pollution
where description like 'clean %' AND biological > 0.01
limit 5
;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('AkRu06489224', datetime.datetime(2021, 1, 10, 9, 44), 'Clean Bacteria: Giardia Lamblia', 0.0897904, 38.467, 'Clean'),
 ('KiRu25473224', datetime.datetime(2021, 2, 7, 15, 51), 'Clean Bacteria: Giardia Lamblia', 0.0630094, 24.4536, 'Clean'),
 ('HaRu17401224', datetime.datetime(2021, 3, 1, 13, 44), 'Clean Bacteria: Giardia Lamblia', 0.0649209, 25.8129, 'Clean'),
 ('AkRu07137224', datetime.datetime(2021, 3, 4, 13, 41), 'Clean Bacteria: Giardia Lamblia', 0.0656843, 18.2978, 'Clean'),
 ('KiRu27205224', datetime.datetime(2021, 3, 13, 14, 17), 'Clean Bacteria: Giardia Lamblia', 0.0418018, 49.4281, 'Clean')]

## We've identified two main problems in the data based on the results:

1. <b> Incorrect Descriptions:</b>
The description field for certain records mistakenly includes "Clean" at the beginning. Specifically, need to correct:
'Clean Bacteria: E. coli' to just 'Bacteria: E. coli'.
'Clean Bacteria: Giardia Lamblia' to just 'Bacteria: Giardia Lamblia'.

2. <b>Misclassified Results:</b>
The results column contains wells incorrectly marked as 'Clean' and the contamination value is greater than 0.01  I am updating these results to 'Contaminated: Biological'.

 * mysql+pymysql://root:***@localhost:3306/md_water_services
0 rows affected.

[]

In [19]:
%%sql 

-- Case 1a: Update 'Clean Bacteria: E. coli' descriptions
UPDATE
    well_pollution
SET
    description = 'Bacteria: E. coli'
WHERE
    description = 'Clean Bacteria: E. coli';

-- Case 1b: Update 'Clean Bacteria: Giardia Lamblia' descriptions
UPDATE
    well_pollution
SET
    description = 'Bacteria: Giardia Lamblia'
WHERE
    description = 'Clean Bacteria: Giardia Lamblia';

-- Case 2: Update 'Clean' results to 'Contaminated: Biological' where biological contamination exists
UPDATE
    well_pollution
SET
    results = 'Contaminated: Biological'
WHERE
    results = 'Clean' AND biological > 0.01;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
0 rows affected.
12 rows affected.
0 rows affected.

[]

In [20]:
%%sql

select*
from well_pollution
where description like 'clean %' AND biological > 0.01
limit 5
;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
0 rows affected.

[]

In [26]:
%%sql 
--creating a new table from the results set of a query to test our resulstd

CREATE TABLE
md_water_services.well_pollution_copy
AS (
SELECT
*
FROM
md_water_services.well_pollution
);

 * mysql+pymysql://root:***@localhost:3306/md_water_services
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MariaDB server version for the right syntax to use near '--creating a new table from the results set of a query to test our resulstd\n\n...' at line 1")
[SQL: --creating a new table from the results set of a query to test our resulstd

CREATE TABLE
md_water_services.well_pollution_copy
AS (
SELECT
*
FROM
md_water_services.well_pollution
);]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [25]:
%%sql  
SELECT -- no rows affected meaning I have edited correctly
*
FROM
well_pollution_copy
WHERE
description LIKE "Clean_%"
OR (results = "Clean" AND biological > 0.01);

 * mysql+pymysql://root:***@localhost:3306/md_water_services
0 rows affected.

[]